<a href="https://colab.research.google.com/github/Mrutyunjay01/Kaggle_practices/blob/master/Pandas_applications.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

**How do I read a tabular data file into pandas?**

In [0]:
orders = pd.read_table("http://bit.ly/chiporders")

In [3]:
orders.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [0]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols) # setting header to None wont read the first row as header

In [5]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

**How do I select a pandas Series from a DataFrame?**

In [0]:
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')

In [12]:
type(ufo)

pandas.core.frame.DataFrame

In [13]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [14]:
ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [15]:
# if the name of the entity dosent contain any space, below method will work.
# but case sensitive to built in methods
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

**WHy do some pandas commands end with parenthesis, and other commands dont?**

In [0]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [17]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [20]:
movies.describe() # gives data abbout only numeric columns

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [21]:
movies.dtypes # says the datatypes of the columns (or attributes)

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

**How do I rename columns in a pandas df?**

In [22]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [23]:
ufo.columns # returns a list with its data types

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [24]:
ufo.rename(columns={'City' : 'Rural'}) # Multiple changes can be done using comma inside the curly braces

                      Rural Colors Reported  ... State              Time
0                    Ithaca             NaN  ...    NY    6/1/1930 22:00
1               Willingboro             NaN  ...    NJ   6/30/1930 20:00
2                   Holyoke             NaN  ...    CO   2/15/1931 14:00
3                   Abilene             NaN  ...    KS    6/1/1931 13:00
4      New York Worlds Fair             NaN  ...    NY   4/18/1933 19:00
...                     ...             ...  ...   ...               ...
18236            Grant Park             NaN  ...    IL  12/31/2000 23:00
18237           Spirit Lake             NaN  ...    IA  12/31/2000 23:00
18238           Eagle River             NaN  ...    WI  12/31/2000 23:45
18239           Eagle River             RED  ...    WI  12/31/2000 23:45
18240                  Ybor             NaN  ...    FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [0]:
# Another approach
# ufo_cols = ['''parse the exact no of names as that of columns''']
#ufo.columns = ufo_cols

In [28]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [30]:
ufo.columns.str.replace(' ', '_')

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

**How to remove columns from pandas df?**

In [31]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [33]:
ufo.shape

(18241, 5)

In [34]:
# drop method
ufo.drop('Colors Reported', axis=1)

                       City Shape Reported State              Time
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00
1               Willingboro          OTHER    NJ   6/30/1930 20:00
2                   Holyoke           OVAL    CO   2/15/1931 14:00
3                   Abilene           DISK    KS    6/1/1931 13:00
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00
...                     ...            ...   ...               ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake           DISK    IA  12/31/2000 23:00
18238           Eagle River            NaN    WI  12/31/2000 23:45
18239           Eagle River          LIGHT    WI  12/31/2000 23:45
18240                  Ybor           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [35]:
ufo.shape

(18241, 5)

In [0]:
# Multiple columns can be dropped by passing a list of strings that contain the column name of the df

In [0]:
# to drop rows, use axis = 0
ufo.drop([0, 1], axis=0, inplace=True)

In [40]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

**Sort a pandas df or series?**

In [42]:
movies.head(10)

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....
5          8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
6          8.9  ...  [u'Clint Eastwood', u'Eli Wallach', u'Lee Van ...
7          8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
8          8.9  ...  [u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings...
9          8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...

[10 rows x 6 columns]

In [44]:
movies.title.sort_values(ascending=False)

864                    [Rec]
526                     Zulu
615               Zombieland
677                   Zodiac
955         Zero Dark Thirty
               ...
110    2001: A Space Odyssey
698                127 Hours
201         12 Years a Slave
5               12 Angry Men
542     (500) Days of Summer
Name: title, Length: 979, dtype: object

In [45]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

**Filter rows of a pandas df by col value?**

In [0]:
booleans = []
for length in movies.duration:
  if length >=200:
    booleans.append(True)
  else:
    booleans.append(False)

In [0]:
is_long = pd.Series(booleans)

In [49]:
is_long.head()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [0]:
# TO do all this shit in a single line
is_long = movies.duration >= 200

In [51]:
is_long.head()

0    False
1    False
2     True
3    False
4    False
Name: duration, dtype: bool

In [52]:
movies[movies.duration >= 200]

     star_rating  ...                                        actors_list
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[12 rows x 6 columns]

****

**apply multiple filters criteria to a pandas dataframe**

In [0]:
# use and or Or between the conditions
cond1 or cond2 # like this